package java1.homework3;

import java.util.Random;

public class Phrase {

    public static void main(String[] args) {

        String[] ph1 = {"Демонический", "Лысый", "Вечерний", "Батарейный", "Ебанутый", "Горластый", "Жопастый",
                "Двинутый", "Фигастый", "Ушастый", "Хуястый", "Деревянный", "Суицидальный", "Моржовый", "Старый"};
        String[] ph2 = {"красный", "зеленый", "серобурмалиновый", "кровавый", "поносный", "говнистый", "задроченный",
                "сисястый", "писястый", "носастый", "мудястый", "пиздастый", "красивый", "хмурый", "ложный", "сложный"};
        String[] ph3 = {"мудак", "педик", "динозавр", "снеговик", "дед мороз", "битл джус", "укроп", "петро", "москаль",
                "лодочник", "чемпион", "кирилл", "стас", "ять", "блядь", "енот79"};
        String[] ph4 = {"позвонил", "накопал", "накакал", "надыбал", "упал", "написал", "уебал", "ковырнул", "плюнул",
                "побрил", "смудил", "облил", "налил", "выпил", "убрал", "сказал"};
        String[] ph5 = {"менту", "гашику наебатору", "бугаге", "снеговику", "аниськину", "фантомасу", "укропу", "михалычу",
                "москалю", "лодочнику", "чемпиону", "кириллу", "стасу", "батьке", "блядям", "еноту79"};

        Random rand = new Random();

        System.out.println(ph1[rand.nextInt(ph1.length - 1)] + " " +
                ph2[rand.nextInt(ph2.length - 1)] + " " +
                ph3[rand.nextInt(ph3.length - 1)] + " "  +
                ph4[rand.nextInt(ph4.length - 1)] + " "  +
                ph5[rand.nextInt(ph5.length - 1)]);

    }

}
