package java2.homework4;

/**
 * @author Stanislav Melekhin
 * Created on 23/01/2019
 */

/*
Создать окно для клиентской части чата: большое текстовое поле для отображения переписки в центре окна.
Однострочное текстовое поле для ввода сообщений и кнопка для отсылки сообщений на нижней панели.
Сообщение должно отсылаться либо по нажатию кнопки на форме, либо по нажатию кнопки Enter.
При «отсылке» сообщение перекидывается из нижнего поля в центральное.
 */

public class StartWindow {

    public static void main(String[] args) {

        new MainWindow();

    }

}
